debug_infos/20260713_current_best_h11_5_h10_8_plus_h10_only/original/baselines/r24/full_run2/run_throughput.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f0a072ccaf0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-98acadb5-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 02:17:56 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:12<00:00,  6.35s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [11:30<00:00, 13.80s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  690.09    
Total input tokens:                      315769    
Total generated tokens:                  12660     
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         18.35     
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          475.92    
---------------Time to First Token----------------
Mean TTFT (ms):                          1835.91   
Median TTFT (ms):                        1924.67   
P50 TTFT (ms):                           1924.67   
P95 TTFT (ms):                           2259.82   
P99 TTFT (ms):                           2372.20   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          47.33     
Median TPOT (ms):                        47.34     
P50 TPOT (ms):                           47.34     
P95 TPOT (ms):                           47.58     
P99 TPOT (ms):                           47.65     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.20     
Median ITL (ms):                         47.39     
P50 ITL (ms):                            47.39     
P95 ITL (ms):                            47.86     
P99 ITL (ms):                            48.46     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13786.14  
Median E2EL (ms):                        6085.43   
P50 E2EL (ms):                           6085.43   
P95 E2EL (ms):                           50472.09  
P99 E2EL (ms):                           50801.18  
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f99396f8af0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-f787e1a1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 02:30:11 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:18<00:00,  9.19s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [14:40<00:00, 17.62s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  880.98    
Total input tokens:                      664763    
Total generated tokens:                  13746     
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         15.60     
Peak output token throughput (tok/s):    22.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          770.17    
---------------Time to First Token----------------
Mean TTFT (ms):                          4431.70   
Median TTFT (ms):                        4735.60   
P50 TTFT (ms):                           4735.60   
P95 TTFT (ms):                           5563.59   
P99 TTFT (ms):                           5569.59   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          48.05     
Median TPOT (ms):                        47.96     
P50 TPOT (ms):                           47.96     
P95 TPOT (ms):                           48.55     
P99 TPOT (ms):                           48.60     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.91     
Median ITL (ms):                         48.11     
P50 ITL (ms):                            48.11     
P95 ITL (ms):                            48.70     
P99 ITL (ms):                            49.23     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          17604.12  
Median E2EL (ms):                        8636.97   
P50 E2EL (ms):                           8636.97   
P95 E2EL (ms):                           52808.05  
P99 E2EL (ms):                           53579.46  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f45b2b70af0>, trust_remote_code=False, seed=0, num_prompts=50, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-268096b1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-12 02:45:43 [datasets.py:232] Skipping oversampling. Total samples: 50.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:17<00:00,  8.98s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [15:56<00:00, 19.13s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  956.63    
Total input tokens:                      1078097   
Total generated tokens:                  10939     
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         11.43     
Peak output token throughput (tok/s):    21.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1138.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          8349.20   
Median TTFT (ms):                        8386.56   
P50 TTFT (ms):                           8386.56   
P95 TTFT (ms):                           8738.31   
P99 TTFT (ms):                           8749.06   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.19     
Median TPOT (ms):                        49.33     
P50 TPOT (ms):                           49.33     
P95 TPOT (ms):                           49.54     
P99 TPOT (ms):                           49.57     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.22     
Median ITL (ms):                         49.47     
P50 ITL (ms):                            49.47     
P95 ITL (ms):                            49.97     
P99 ITL (ms):                            50.57     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          19117.11  
Median E2EL (ms):                        16577.42  
P50 E2EL (ms):                           16577.42  
P95 E2EL (ms):                           59411.25  
P99 E2EL (ms):                           59450.32  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/4-8K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260712_h11_4_h10_7_full_run2/results/16-32K_throughput/result.json